package com.code.algorithm.msb.test;

/**
 * 算法复杂度、对数器、二分法、异或操作
 *
 * @author Zjianru
 * @date 2021/5/31
 */
public class Lesson1 {
    /**
     * 常见的常数时间的操作
     * 1. 常见的算术运算 ( + - * / %等)
     * 2. 常见的位运算  ( >>带符号右移,>>>不带符号右移,<<,|,&,^ 等 )
     * 3. 赋值，比较，自增，自减 等
     * 4. 数组寻址操作
     * 执行时间固定的操作都是常数时间的操作
     * 执行时间不固定的操作都不是常数时间的操作
     *
     * 如何确定算法流程的总操作数量与样本数量之间的表达式关系？
     * 1. 想想该算法流程所处理的数据状况 —— 按照最差情况来
     * 2. 把整个流程彻底拆分成一个个基本动作，保证每个动作都是常数时间的操作
     * 3. 如果数量为 N，看看基本动作数量和 N 是什么关系
     */

}
